# DataFrame

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import webbrowser
website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

## コピーしているものを呼び出す:pd.read_clipboard()

In [5]:
nfl_frame = pd.read_clipboard()

In [6]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North

## columnsを表示

In [7]:
nfl_frame.columns

Index(['Rank', 'Team', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Total Games', 'Division'],
      dtype='object')

## 列のデータを抽出

In [8]:
nfl_frame['First NFL Season']

0    1960
1    1921
2    1920
3    1966
4    1960
5    1961
Name: First NFL Season, dtype: int64

In [9]:
nfl_frame.Team

0             Dallas Cowboys
1          Green Bay Packers
2              Chicago Bears
3             Miami Dolphins
4    New England Patriots[b]
5          Minnesota Vikings
Name: Team, dtype: object

In [10]:
nfl_frame[['Team', 'First NFL Season']]

                      Team  First NFL Season
0           Dallas Cowboys              1960
1        Green Bay Packers              1921
2            Chicago Bears              1920
3           Miami Dolphins              1966
4  New England Patriots[b]              1960
5        Minnesota Vikings              1961

## 新しいデータフレームを作成

In [11]:
DataFrame(nfl_frame, columns=['Team', 'First NFL Season'])

                      Team  First NFL Season
0           Dallas Cowboys              1960
1        Green Bay Packers              1921
2            Chicago Bears              1920
3           Miami Dolphins              1966
4  New England Patriots[b]              1960
5        Minnesota Vikings              1961

### 存在しないcolumnsを指定するとNaNが入る

In [22]:
DataFrame(nfl_frame, columns=['Team', 'First NFL Season', 'Stadium'])

                      Team  First NFL Season  Stadium
0           Dallas Cowboys              1960      NaN
1        Green Bay Packers              1921      NaN
2            Chicago Bears              1920      NaN
3           Miami Dolphins              1966      NaN
4  New England Patriots[b]              1960      NaN
5        Minnesota Vikings              1961      NaN

## 先頭の五行を取り出す:head()
- head(3)とすると先頭の三行

In [23]:
nfl_frame.head()

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East

In [24]:
nfl_frame.head(3)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North

## 最後の五行を表示:tail()
- tail(3)とすると三行

In [25]:
nfl_frame.tail()

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North

In [26]:
nfl_frame.tail(3)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North

## インデックスを使ってデータにアクセスする:ix

In [27]:
nfl_frame.ix[3]

Rank                             4
Team                Miami Dolphins
Won                            445
Lost                           351
Tied                             4
Pct.                         0.559
First NFL Season              1966
Total Games                    800
Division                  AFC East
Name: 3, dtype: object

## 新しい列を追加

In [30]:
nfl_frame['Stadium'] = "Levi's Stadium"

In [31]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East,Levi's Stadium
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North,Levi's Stadium
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North,Levi's Stadium
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East,Levi's Stadium
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East,Levi's Stadium
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North,Levi's Stadium

In [32]:
nfl_frame['Stadium'] = np.arange(6)

In [33]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East,0
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North,1
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North,2
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East,3
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East,4
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North,5

In [34]:
stadiums = Series(["Levi's Stadium", 'AT&T Stadium'], index=[4, 0])

In [35]:
stadiums

4    Levi's Stadium
0      AT&T Stadium
dtype: object

In [36]:
nfl_frame['Stadium'] = stadiums

In [37]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East,AT&T Stadium
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North,NaN
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North,NaN
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East,NaN
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East,Levi's Stadium
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North,NaN

## 列を消す:del

In [38]:
del nfl_frame['Stadium']

In [39]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East
5,6,Minnesota Vikings,470,390,10,0.546,1961,870,NFC North

## データフレームを辞書から作る

In [40]:
data = {'City':['SF','LA','NYC'],
        'Population':[837000,3880000,8400000]}

In [41]:
city_frame = DataFrame(data)

In [42]:
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

# indexの基本

In [43]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [44]:
my_ser = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

In [45]:
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [46]:
my_index = my_ser.index

In [47]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [48]:
my_index[0]

'A'

In [49]:
my_index[2]

'C'

In [50]:
my_index[2:]

Index(['C', 'D'], dtype='object')

# indexを変える

In [51]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
from numpy.random import randn

In [52]:
ser1 = Series([1, 2, 3, 4], index = ['A', 'B', 'C', 'D'])

In [53]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

## indexを付け替える:reindex()

In [54]:
ser2 = ser1.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [55]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [56]:
ser2.reindex(['A', 'B', 'C', 'D', 'E', 'F', 'G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [57]:
ser3 = Series(['USA', 'Mexico', 'Canada'], index = [0, 5, 10])

In [58]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [59]:
ser3.reindex(range(15), method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [61]:
dframe = DataFrame(randn(25).reshape((5, 5)), index=['A', 'B', 'D', 'E', 'F'], columns=['col1', 'col2', 'col3', 'col4', 'col5'])

In [62]:
dframe

       col1      col2      col3      col4      col5
A -1.752010 -0.105977 -0.110028  1.687492  1.492640
B  2.222035 -0.359708  0.011275  0.786973  0.051941
D  0.108901  0.242585 -1.339697 -1.142796  0.396756
E  0.313730  0.573662 -0.151099  1.544354  1.020316
F -1.135558 -0.076518 -0.132734 -1.074436  0.279907

In [63]:
new_index = ['A', 'B', 'C', 'D', 'E', 'F']
dframe2 = dframe.reindex(new_index)

In [64]:
dframe2

       col1      col2      col3      col4      col5
A -1.752010 -0.105977 -0.110028  1.687492  1.492640
B  2.222035 -0.359708  0.011275  0.786973  0.051941
C       NaN       NaN       NaN       NaN       NaN
D  0.108901  0.242585 -1.339697 -1.142796  0.396756
E  0.313730  0.573662 -0.151099  1.544354  1.020316
F -1.135558 -0.076518 -0.132734 -1.074436  0.279907

In [65]:
new_columns = ['col1', 'col2', 'col3', 'col4', 'col5', 'col6']
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -1.752010 -0.105977 -0.110028  1.687492  1.492640   NaN
B  2.222035 -0.359708  0.011275  0.786973  0.051941   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.108901  0.242585 -1.339697 -1.142796  0.396756   NaN
E  0.313730  0.573662 -0.151099  1.544354  1.020316   NaN
F -1.135558 -0.076518 -0.132734 -1.074436  0.279907   NaN

In [66]:
dframe

       col1      col2      col3      col4      col5
A -1.752010 -0.105977 -0.110028  1.687492  1.492640
B  2.222035 -0.359708  0.011275  0.786973  0.051941
D  0.108901  0.242585 -1.339697 -1.142796  0.396756
E  0.313730  0.573662 -0.151099  1.544354  1.020316
F -1.135558 -0.076518 -0.132734 -1.074436  0.279907

In [68]:
dframe.ix[new_index, new_columns]

       col1      col2      col3      col4      col5  col6
A -1.752010 -0.105977 -0.110028  1.687492  1.492640   NaN
B  2.222035 -0.359708  0.011275  0.786973  0.051941   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.108901  0.242585 -1.339697 -1.142796  0.396756   NaN
E  0.313730  0.573662 -0.151099  1.544354  1.020316   NaN
F -1.135558 -0.076518 -0.132734 -1.074436  0.279907   NaN

# 行や列を削除する

In [69]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [70]:
ser1 = Series(np.arange(3), index=['A', 'B', 'C'])

In [71]:
ser1

A    0
B    1
C    2
dtype: int64

In [72]:
ser1.drop('B')

A    0
C    2
dtype: int64

In [73]:
dframe1 = DataFrame(np.arange(9).reshape((3, 3)), index=['SF', 'LA', 'NY'], columns=['pop', 'size', 'year'])

In [74]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [75]:
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [76]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8